문제
를 수정하여 저장하기
요구사항
- Unnamed:0라고 표기되는 열을 지운다. 단 Unnamed:0라 쓰지말고 새롭게 컬럼 이름을 만들어서 지운다.
- 0,1,2,3,4로 보여지는 index 부분을 지운다.
- name에 해당되는 영문 이름을 한글로 바꾼다.
- salary에 해당되는 숫자를 000 세자리 단위로 콤마를 넣어서 값을 바꿔 넣는다.
- 1~4를 처리하고 나서 csv파일로 저장한다.
제출은 파이썬 파일 혹은 쥬피터 파일을 작성하여 업로드하면 된다

- pandas로 my_data.csv 읽기

In [22]:
import pandas as pd
csv_path = './my_data.csv'
df = pd.read_csv(csv_path)
df

   Unnamed: 0     name  age  salary
0           0    Alice   25   50000
1           1      Bob   30   60000
2           2  Charlie   35   70000
3           3    james   30  400000
4           4    Alice   25   50000
5           5      Bob   30   60000
6           6  Charlie   35   70000
7           7    james   30  400000

- Unnamed:0라고 표기되는 열을 지운다. 단 Unnamed:0라 쓰지말고 새롭게 컬럼 이름을 만들어서 지운다.

In [23]:
df = df.rename(columns={'Unnamed: 0':"index"})
df

   index     name  age  salary
0      0    Alice   25   50000
1      1      Bob   30   60000
2      2  Charlie   35   70000
3      3    james   30  400000
4      4    Alice   25   50000
5      5      Bob   30   60000
6      6  Charlie   35   70000
7      7    james   30  400000

- 0,1,2,3,4로 보여지는 index 부분을 지운다.

In [24]:
df = df.reset_index(drop=True)
df

   index     name  age  salary
0      0    Alice   25   50000
1      1      Bob   30   60000
2      2  Charlie   35   70000
3      3    james   30  400000
4      4    Alice   25   50000
5      5      Bob   30   60000
6      6  Charlie   35   70000
7      7    james   30  400000

- name에 해당되는 영문 이름을 한글로 바꾼다.

In [29]:
df.loc[df['name']=='Alice','name'] = '앨리스'
df.loc[df['name']=='Bob','name'] = '밥'
df.loc[df['name']=='Charlie','name'] = '찰리'
df.loc[df['name']=='james','name'] = '제임스'
df

   index name  age  salary
0      0  앨리스   25   50000
1      1    밥   30   60000
2      2   찰리   35   70000
3      3  제임스   30  400000
4      4  앨리스   25   50000
5      5    밥   30   60000
6      6   찰리   35   70000
7      7  제임스   30  400000

- salary에 해당되는 숫자를 000 세자리 단위로 콤마를 넣어서 값을 바꿔 넣는다.

In [30]:
df = df.applymap(lambda x: '{:,}'.format(x) if isinstance(x, (int, float)) else x)

In [31]:
df

  index name age   salary
0     0  앨리스  25   50,000
1     1    밥  30   60,000
2     2   찰리  35   70,000
3     3  제임스  30  400,000
4     4  앨리스  25   50,000
5     5    밥  30   60,000
6     6   찰리  35   70,000
7     7  제임스  30  400,000